In [45]:
from pyarrow import dataset as ds
from pyarrow import parquet as pq
import pyarrow as pa
import pandas as pd
import mmd_utils as mmt

In [22]:
# Let's read the data as pyarrow table
dataset = ds.dataset(
        "s3://anonymous@air-example-data/ursa-labs-taxi-data/by_year/",
        partitioning=["year", "month"],
)

In [27]:
file=f"s3://anonymous@{dataset.files[-1:][0]}"
file

's3://anonymous@air-example-data/ursa-labs-taxi-data/by_year/2019/06/data.parquet/ab5b9d2b8cc94be19346e260b543ec35_000000.parquet'

In [38]:
df = pq.read_table(
        file,
        filters=[("pickup_location_id", "=", 25)],
        columns=[
            "pickup_at",
            "dropoff_at",
            "pickup_location_id",
            "dropoff_location_id",
        ],
    ).to_pandas()

In [40]:
display(df.head(5))

,pickup_at,dropoff_at,pickup_location_id,dropoff_location_id
0,2019-06-01 00:05:58,2019-06-01 00:17:01,25,97
1,2019-06-01 00:50:49,2019-06-01 00:53:58,25,25
2,2019-06-01 00:33:28,2019-06-01 00:35:41,25,181
3,2019-06-01 00:09:27,2019-06-01 00:23:05,25,89
4,2019-06-01 00:04:32,2019-06-01 00:09:51,25,181

In [46]:
transform_df = mmt.transform_batch(df)

In [47]:
display(transform_df.head(5))

,pickup_at,dropoff_at,pickup_location_id,dropoff_location_id,trip_duration
0,2019-06-01 00:05:58,2019-06-01 00:17:01,25,97,663
1,2019-06-01 00:50:49,2019-06-01 00:53:58,25,25,189
2,2019-06-01 00:33:28,2019-06-01 00:35:41,25,181,133
3,2019-06-01 00:09:27,2019-06-01 00:23:05,25,89,818
4,2019-06-01 00:04:32,2019-06-01 00:09:51,25,181,319